app/controllers/overrides/registrations_controller.rb

                        @user.birthday = params[:birthday]
                        @user.gender = params[:gender]

                        @user.save!

                        @profile = Profile.new(:user_id => current_user.id, :function => 1, :profile =>1)
                        @profile.save!
---
INSERT INTO "users" ("uid", "encrypted_password", "email", "tokens", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "name" = $1, "cpf" = $2, "birthday" = $3, "gender" = $4, "tokens" = $5, "updated_at" = $6 WHERE "users"."id" = $7
INSERT INTO "profiles" ("user_id", "profile_type", "function", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["profile_type", "1"], ["function", 1], ["created_at", "2018-04-02 21:03:37.316977"], ["updated_at", "2018-04-02 21:03:37.316977"]]