app/controllers/informations_controller.rb

INSERT INTO "addresses" ("user_id", "number", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 11], ["number", "17133"], ["created_at", "2018-03-16 19:06:05.796749"], ["updated_at", "2018-03-16 19:06:05.796749"]]
INSERT INTO "contacts" ("user_id", "phone", "cellphone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 11], ["phone", "87654321"], ["cellphone", "56789098765"], ["created_at", "2018-03-16 19:47:08.802570"], ["updated_at", "2018-03-16 19:47:08.802570"]]
---
    def create
        if current_user
            @user_id = current_user.id
            @contact = contacts_create
            @address = address_create

            if @contact.save! && @address.save!

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1 LIMIT $2  [["user_id", 11], ["LIMIT", 1]]
UPDATE "contacts" SET "cellphone" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["cellphone", "56789098765"], ["updated_at", "2018-03-19 17:55:00.206128"], ["id", 4]]
UPDATE "users" SET "tokens" = $1, "updated_at" = $2 WHERE "users"."id" = $3
UPDATE "addresses" SET "public_place" = $1, "number" = $2, "city" = $3, "state" = $4, "country" = $5, "cep" = $6, "updated_at" = $7 WHERE "addresses"."id" = $8
---
    def update
        if current_user
            contact = Contact.find_by(user_id: current_user.id)
            address = Address.find_by(user_id: current_user.id)

            if contact.update(contact_params)
                if address.update(address_params)

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1 AND "contacts"."rating" = $2 LIMIT $3  [["user_id", 1], ["rating", 4], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
    def show
        if current_user
            @contacts = Contact.find_by(user_id: current_user.id, rating: 4)
            @address = Address.find_by(user_id: current_user.id, rating: 4)