app/controllers/profile_controller.rb

  def profile
      if current_user
          @profile = Profile.find(current_user.id)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    if current_user
      @name = params[:name]
      @cpf = params[:cpf]
      @gender = params[:gender]
      @birthday = params[:birthday]
      @profile = Profile.new(:user_id => current_user.id, :cpf => @cpf, :gender => @gender, :birthday => @birthday, :name => @name)
      if @profile.save
        @contactsCreate = contacts_create
        if @contactsCreate.save
---
INSERT INTO "profiles" ("user_id", "name", "cpf", "birthday", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 1], ["name", "tony"], ["cpf", "31231231"], ["birthday", "1991-04-19"], ["gender", "masc"], ["created_at", "2018-03-11 17:15:10.296662"], ["updated_at", "2018-03-11 17:15:10.296662"]]
INSERT INTO "contacts" ("profile_id", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["profile_id", 2], ["email", "tony@gmail.com"], ["created_at", "2018-03-11 17:46:06.169664"], ["updated_at", "2018-03-11 17:46:06.169664"]]