app/controllers/stores_controller.rb

INSERT INTO "users_stores" ("user_id", "store_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["store_id", 2], ["created_at", "2018-04-02 21:11:30.462790"], ["updated_at", "2018-04-02 21:11:30.462790"]]
---
    def create
        if current_user()
            if profile_permission(current_user.id && !duplicateStore?())
                Store.transaction do
                    @store = Store.new(store_params())
                    if @store.save!
                        @user_store = UsersStore.new(user_store_params())
                        if @user_store.save!