app/controllers/stores_controller.rb

    def create
        if current_user()
            @store = Store.new(store_params())
            if profile_permission(current_user())
                render_json(203, "Profile has no permission")
            end
            if @store.save!
                @user_store = user_store_create()
                if @user_store.save!
---
INSERT INTO "stores" ("name", "CNPJ", "category", "longitude", "latitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "users" SET "tokens" = $1, "updated_at" = $2 WHERE "users"."id" = $3

    def show_stores
        if current_user()
            @store = Store.find(session[:store_id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def show
        if current_user()
            @stores = Store.all
---
SELECT "stores".* FROM "stores"

    def save_images
        @imagesSave = ImagesStore.new(store_images_params())
        if @imagesSave.save
---
INSERT INTO "images_stores" ("store_id", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"